taskt/Core/Automation/Commands/WebBrowserGroup/ASeleniumWebDriverActionCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands" [ label="ASeleniumExecuteJavaScriptCommands", style="dashed", ];
"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands" [ label="ASeleniumWebDriverActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.SeleniumBrowserGetWebBrowserSizeCommand" [ label="SeleniumBrowserGetWebBrowserSizeCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserGetWebBrowserPositionCommand" [ label="SeleniumBrowserGetWebBrowserPositionCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserResizeWebBrowserCommand" [ label="SeleniumBrowserResizeWebBrowserCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserSwitchWebBrowserFrameCommand" [ label="SeleniumBrowserSwitchWebBrowserFrameCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserTakeScreenshotOfWebBrowserCommand" [ label="SeleniumBrowserTakeScreenshotOfWebBrowserCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserCloseWebBrowserInstanceCommand" [ label="SeleniumBrowserCloseWebBrowserInstanceCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserSwitchWebBrowserWindowAndTabCommand" [ label="SeleniumBrowserSwitchWebBrowserWindowAndTabCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserNavigateBackCommand" [ label="SeleniumBrowserNavigateBackCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserNavigateForwardCommand" [ label="SeleniumBrowserNavigateForwardCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserNavigateToURLCommand" [ label="SeleniumBrowserNavigateToURLCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserRefreshWebBrowserCommand" [ label="SeleniumBrowserRefreshWebBrowserCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromFileCommand" [ label="SeleniumBrowserExecuteJavaScriptFromFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromCodeCommand" [ label="SeleniumBrowserExecuteJavaScriptFromCodeCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserGetWebBrowserSizeCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserGetWebBrowserPositionCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserResizeWebBrowserCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserSwitchWebBrowserFrameCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserTakeScreenshotOfWebBrowserCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserCloseWebBrowserInstanceCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserSwitchWebBrowserWindowAndTabCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserNavigateBackCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserNavigateForwardCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserNavigateToURLCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserRefreshWebBrowserCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromFileCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands";
"taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromCodeCommand" -> "taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands";
}
