taskt/Core/Automation/Commands/WebBrowserGroup/ASeleniumWebDriverActionCommands_[%reverse%].puml
@startuml
left to right direction
package "taskt.Core.Automation.Commands.WebBrowserGroup"{
abstract class "ASeleniumExecuteJavaScriptCommands"{
#ExecuteJavaScriptProcess() : void 
+v_Arguments : String <<get>> <<set>> 
+v_Result : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands.WebBrowserGroup"{
abstract class "ASeleniumWebDriverActionCommands"{
+v_InstanceName : String <<get>> <<set>> 
+v_WhenFailAction : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserGetWebBrowserSizeCommand" <<sealed>> {
+RunCommand() : void 
+v_Width : String <<get>> <<set>> 
+v_Height : String <<get>> <<set>> 
+v_SizeType : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserGetWebBrowserPositionCommand" <<sealed>> {
+RunCommand() : void 
-GetPosition() : ValueTuple
-StoreXYProcess() : void 
+v_XPosition : String <<get>> <<set>> 
+v_YPosition : String <<get>> <<set>> 
+v_PositionType : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserResizeWebBrowserCommand" <<sealed>> {
+RunCommand() : void 
+v_BrowserWidth : String <<get>> <<set>> 
+v_BrowserHeight : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserSwitchWebBrowserFrameCommand" <<sealed>> {
+RunCommand() : void 
+v_SelectionType : String <<get>> <<set>> 
+v_FrameParameter : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserTakeScreenshotOfWebBrowserCommand" <<sealed>> {
+RunCommand() : void 
+v_SeleniumScreenshotPathParameter : String <<get>> <<set>> 
+v_SeleniumScreenshotFileNameParameter : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserCloseWebBrowserInstanceCommand" <<sealed>> {
+RunCommand() : void 
+v_DeleteProfileFolder : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserSwitchWebBrowserWindowAndTabCommand" <<sealed>> {
+RunCommand() : void 
+v_CheckTarget : String <<get>> <<set>> 
+v_CheckMethod : String <<get>> <<set>> 
+v_CheckText : String <<get>> <<set>> 
+v_CaseSensitive : String <<get>> <<set>> 
+v_TrimBeforeCheck : String <<get>> <<set>> 
+v_SelectionMethod : String <<get>> <<set>> 
+v_SelectionIndex : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserNavigateBackCommand" <<sealed>> {
+RunCommand() : void 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserNavigateForwardCommand" <<sealed>> {
+RunCommand() : void 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserNavigateToURLCommand" <<sealed>> {
+RunCommand() : void 
+v_URL : String <<get>> <<set>> 
+v_UseHttps : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserRefreshWebBrowserCommand" <<sealed>> {
+RunCommand() : void 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserExecuteJavaScriptFromFileCommand" <<sealed>> {
+RunCommand() : void 
+v_FilePath : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SeleniumBrowserExecuteJavaScriptFromCodeCommand" <<sealed>> {
+RunCommand() : void 
+v_ScriptCode : String <<get>> <<set>> 
}
}

taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserGetWebBrowserSizeCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserGetWebBrowserPositionCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserResizeWebBrowserCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserSwitchWebBrowserFrameCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserTakeScreenshotOfWebBrowserCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserCloseWebBrowserInstanceCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserSwitchWebBrowserWindowAndTabCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserNavigateBackCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserNavigateForwardCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserNavigateToURLCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserRefreshWebBrowserCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumWebDriverActionCommands
taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromFileCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands
taskt.Core.Automation.Commands.SeleniumBrowserExecuteJavaScriptFromCodeCommand --|> taskt.Core.Automation.Commands.WebBrowserGroup.ASeleniumExecuteJavaScriptCommands
@enduml
